 export const locationData: Record<string, string[]> = {
    "شمال غزة": ["جباليا", "مخيم جباليا", "بيت لاهيا", "بيت حانون", "العطاطرة", "مشروع بيت لاهيا", "عزبة عبد ربه", "أم النصر", "القرية البدوية"],
    "غزة": ["مدينة غزة", "الشجاعية", "الرمال", "الشيخ رضوان", "تل الهوى", "الزيتون", "الصبرة", "التفاح", "النصر", "الدرج", "الشيخ عجلين", "مخيم الشاطئ", "الزهراء", "المغراقة", "جحر الديك"],
    "الوسطى": ["دير البلح", "النصيرات", "مخيم النصيرات", "البريج", "مخيم البريج", "المغازي", "مخيم المغازي", "الزوايدة", "وادي غزة"],
    "خان يونس": ["خان يونس", "بني سهيلا", "عبسان الكبيرة", "عبسان الجديدة", "خزاعة", "القرارة", "السطر الشرقي", "السطر الغربي", "معن", "قيزان النجار", "قيزان أبو رشوان"],
    "رفح": ["رفح", "مخيم رفح", "تل السلطان", "الشوكة", "النصر", "مصبح", "خربة العدس", "حي الجنينة", "حي السلام"]
  };